fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>EnumRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_РассчитатьУдержанияНДФЛ/Module.bsl
#Область ПрограммныйИнтерфейс 

// Расчет Удержания (НДФЛ) для указанного документа запись результата в регистр расчета Удержания
 // Рассчитать начисления.
 // 
 // Параметры:
 //  Регистратор - ДокументСсылка - Ссылка на документ, где необходимо расчитать удержание
 //  НаборЗаписей - РегистрРасчетаНаборЗаписей.ВКМ_Удержания - Регистр расчета Удержания
 Процедура РассчитатьНачисления (Регистратор, НаборЗаписей) Экспорт
	 
	 // РАСЧЕТ НДФЛ (13%)
	 // Формула расчета: [сумма выплаты] * 13/100
	 
	 ТекстЗапроса = 
	 "ВЫБРАТЬ
	 |	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	 |	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК База,
	 |	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Показатель, 0) КАК Показатель
	 |ИЗ
	 |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
	 |				&Измерения,
	 |				&Измерения,
	 |				,
	 |				Регистратор = &Регистратор
	 |					И ВидРасчета = &ВидРасчетаНДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	 |		ПО ВКМ_Удержания.Сотрудник = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник
	 |			И ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
	 |ГДЕ
	 |	ВКМ_Удержания.Регистратор = &Регистратор
	 |	И ВКМ_Удержания.ВидРасчета = &ВидРасчетаНДФЛ"; 
	 
	 Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВКМ_НачислениеЗаработаннойПлаты") Тогда
		 ТекстЗапроса = ТекстЗапроса;
	 ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВКМ_НачислениеФиксированнойПремии") Тогда
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОсновныеНачисления", "ДополнительныеНачисления");
	 КонецЕсли;
	 Запрос = Новый Запрос;
	 Запрос.Текст = ТекстЗапроса;
	 
	 Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	 Запрос.УстановитьПараметр("Регистратор", Регистратор);
	 Измерения = Новый Массив;
	 Измерения.Добавить("Сотрудник");
	 Измерения.Добавить("Подразделение");
	 
	 Запрос.УстановитьПараметр("Измерения", Измерения);
	 СтруктураПоиска = Новый Структура;
	 СтруктураПоиска.Вставить("НомерСтроки", 0);
	 Выборка = Запрос.Выполнить().Выбрать();
	 Для Каждого Запись Из НаборЗаписей Цикл
		 СтруктураПоиска.НомерСтроки = Запись.НомерСтроки;
		 Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			 Запись.Результат = Выборка.Показатель * 13/100;
		 КонецЕсли;
		 Выборка.Сбросить();
	 КонецЦикла;
	 
	 НаборЗаписей.Записать(, Истина); 	
	 
 КонецПроцедуры 
 
 #КонецОбласти
